---
kind: type
id: T:Autodesk.Revit.DB.ColorOptions
source: html/1ca57d8c-b970-83b4-c5ce-9e39464e5cc2.htm
---
# Autodesk.Revit.DB.ColorOptions

A class providing access to color settings which affect the colors applied to specific views.

## Syntax (C#)
```csharp
public class ColorOptions : IDisposable
```

## Remarks
ColorOptions are managed and stored along with other global application options and thus impact the application as a whole.